### Creation d'une base de données avec MySQL

In [ ]:
# install in first the connector mysql python if you didn't have it
## !pip install mysql-connector-python ipython-sql

In [1]:
# loading sql extension
%load_ext sql

In [2]:
# Connection to MySQL
%sql mysql+mysqlconnector://root:confidentiel@localhost/

In [3]:
# Creation of the database
%sql CREATE DATABASE films_base;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [4]:
# Positioning into the database
%sql USE films_base;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

#### Creation of the first table

In [5]:
%%sql
CREATE TABLE films (
    id INT AUTO_INCREMENT PRIMARY KEY,
    titre VARCHAR(255),
    annee_sortie INT,
    duree INT,
    genre VARCHAR(100)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

#### Creation of the second table

In [6]:
%%sql
CREATE TABLE direction_artistic (
    id INT AUTO_INCREMENT PRIMARY KEY,
    films_id INT,
    realisation VARCHAR(255),
    scenario VARCHAR(255),
    FOREIGN KEY (films_id) REFERENCES films(id)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [7]:
# Checking the success of the creation
%sql SHOW TABLES;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[('direction_artistic',), ('films',)]

In [8]:
# Checking of the structure of the first table
%sql SHOW COLUMNS FROM films;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('titre', 'varchar(255)', 'YES', '', None, ''),
 ('annee_sortie', 'int', 'YES', '', None, ''),
 ('duree', 'int', 'YES', '', None, ''),
 ('genre', 'varchar(100)', 'YES', '', None, '')]

In [9]:
# Checking of the structure of the second table
%sql SHOW COLUMNS FROM direction_artistic;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[('id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('films_id', 'int', 'YES', 'MUL', None, ''),
 ('realisation', 'varchar(255)', 'YES', '', None, ''),
 ('scenario', 'varchar(255)', 'YES', '', None, '')]

#### Insert data in our first table

In [10]:
%%sql 
INSERT INTO films (titre, annee_sortie, duree, genre) VALUES 
('The Woman King', 2022, 135, 'Action'),
('Black Adam', 2022, 124, 'Science-fiction'),
('Ray', 2004, 152, 'Drame'),
('Cash', 2023, 95, 'Comédie'),
('Aquaman and the Lost Kingdom', 2023, 124, 'Action'),
('En plein vol', 2024, 104, 'Comédie'),
('Badland hunters', 2024, 107, 'Action');

 * mysql+mysqlconnector://root:***@localhost/
7 rows affected.

[]

In [11]:
# Checking
%sql SELECT * FROM films;

 * mysql+mysqlconnector://root:***@localhost/
7 rows affected.

[(1, 'The Woman King', 2022, 135, 'Action'),
 (2, 'Black Adam', 2022, 124, 'Science-fiction'),
 (3, 'Ray', 2004, 152, 'Drame'),
 (4, 'Cash', 2023, 95, 'Comédie'),
 (5, 'Aquaman and the Lost Kingdom', 2023, 124, 'Action'),
 (6, 'En plein vol', 2024, 104, 'Comédie'),
 (7, 'Badland hunters', 2024, 107, 'Action')]

#### Insert data in our second table

In [12]:
%%sql
INSERT INTO direction_artistic (films_id, realisation, scenario) VALUES
(2, 'Jaume Collet-Serra', 'Adam Sztykiel'),
(5, 'James Wan', 'David Leslie Johnson-McGoldrick'),
(1, 'Gina Prince-Bythewood', 'Viola Davis'),
(3, 'Taylor Hackford', 'James L. White'),
(4, 'Jérémie Rozan', 'Jérémie Rozan'),
(6, 'F. Gary Gray', 'Dan Kunka & Jeremy Doner'),
(7, 'Heo Myeong-haeng', 'Kim Bo-tong & Kwak Jae-min');

 * mysql+mysqlconnector://root:***@localhost/
7 rows affected.

[]

In [13]:
# Checking
%sql SELECT * FROM direction_artistic;

 * mysql+mysqlconnector://root:***@localhost/
7 rows affected.

[(1, 2, 'Jaume Collet-Serra', 'Adam Sztykiel'),
 (2, 5, 'James Wan', 'David Leslie Johnson-McGoldrick'),
 (3, 1, 'Gina Prince-Bythewood', 'Viola Davis'),
 (4, 3, 'Taylor Hackford', 'James L. White'),
 (5, 4, 'Jérémie Rozan', 'Jérémie Rozan'),
 (6, 6, 'F. Gary Gray', 'Dan Kunka & Jeremy Doner'),
 (7, 7, 'Heo Myeong-haeng', 'Kim Bo-tong & Kwak Jae-min')]

#### Join of our tables

In [14]:
%%sql
SELECT 
    f.*,
    d.realisation,
    d.scenario
FROM films AS f
JOIN direction_artistic AS d ON f.id = d.films_id;

 * mysql+mysqlconnector://root:***@localhost/
7 rows affected.

[(1, 'The Woman King', 2022, 135, 'Action', 'Gina Prince-Bythewood', 'Viola Davis'),
 (2, 'Black Adam', 2022, 124, 'Science-fiction', 'Jaume Collet-Serra', 'Adam Sztykiel'),
 (3, 'Ray', 2004, 152, 'Drame', 'Taylor Hackford', 'James L. White'),
 (4, 'Cash', 2023, 95, 'Comédie', 'Jérémie Rozan', 'Jérémie Rozan'),
 (5, 'Aquaman and the Lost Kingdom', 2023, 124, 'Action', 'James Wan', 'David Leslie Johnson-McGoldrick'),
 (6, 'En plein vol', 2024, 104, 'Comédie', 'F. Gary Gray', 'Dan Kunka & Jeremy Doner'),
 (7, 'Badland hunters', 2024, 107, 'Action', 'Heo Myeong-haeng', 'Kim Bo-tong & Kwak Jae-min')]